DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/spi/SPICC26XXDMA.c
        /*
         * Determine if the RX DMA channel has completed... In slave mode this interrupt
         * occurrence depends on when the SPI master starts sending data.
         */
        if (UDMACC26XX_channelDone(object->udmaHandle, hwAttrs->rxChannelBitMask)) {
            /* Disable SPI RX DMA and clear DMA done interrupt. */
            SSIDMADisable(hwAttrs->baseAddr, SSI_DMA_RX);
            UDMACC26XX_clearInterrupt(object->udmaHandle, hwAttrs->rxChannelBitMask);

            /* Post SWI to handle remaining clean up and invocation of callback */
            Swi_post(Swi_handle(&(object->swi)));
        }
    }

    Log_print1(Diags_USER2, "SPI:(%p) hwi interrupt context end",
                             hwAttrs->baseAddr);
}

/*
 *  ======== SPICC26XXDMA_swiFxn ========
 *  SWI ISR for the SPI when we use the UDMA
 *  Determine if the RX DMA channel has completed... In slave mode this interrupt
 *  occurrence depends on when the SPI master starts sending data.
 */
static void SPICC26XXDMA_swiFxn (UArg arg0, UArg arg1) {
    SPI_Transaction         *msg;
    SPICC26XXDMA_Object     *object;

    /* Get the pointer to the object and hwAttrs */
    object = ((SPI_Handle)arg0)->object;

    Log_print1(Diags_USER2, "SPI:(%p) swi interrupt context start",
                             ((SPICC26XXDMA_HWAttrs const *)(((SPI_Handle)arg0)->hwAttrs))->baseAddr);

    /* Clean up SPI and DMA */
    /* Transaction is complete */
    object->currentTransaction->status = SPI_TRANSFER_COMPLETED;

    /* Use a temporary transaction pointer in case the callback function
     * attempts to perform another SPI_transfer call
     */
    msg = object->currentTransaction;

    Log_print2(Diags_USER1,"SPI:(%p) DMA transaction: %p complete",
                            ((SPICC26XXDMA_HWAttrs const  *)(((SPI_Handle)arg0)->hwAttrs))->baseAddr, (UArg)msg);

    /* Release constraint since transaction is done */
    threadSafeConstraintRelease((uint32_t)(object->currentTransaction->txBuf), object);

    /* Indicate we are done with this transfer */
    object->currentTransaction = NULL;

    /* Perform callback */
    object->transferCallbackFxn((SPI_Handle)arg0, msg);

    Log_print1(Diags_USER2, "SPI:(%p) swi interrupt context end",
                             ((SPICC26XXDMA_HWAttrs const  *)(((SPI_Handle)arg0)->hwAttrs))->baseAddr);
}

/*
 *  ======== SPICC26XXDMA_serviceISR ========
 */
void SPICC26XXDMA_serviceISR(SPI_Handle handle) {
    /* Function is not supported */
    Assert_isTrue(false, NULL);
}

/*
 *  ======== SPICC26XXDMA_flushTxFifo ========
 */
void SPICC26XXDMA_flushFifos(SPI_Handle handle) {

    /* Locals */
    SPICC26XXDMA_HWAttrs const  *hwAttrs;

    /* Get the pointer to the hwAttrs */
    hwAttrs = handle->hwAttrs;

    /* Flush RX FIFO */
    while(HWREG(hwAttrs->baseAddr + SSI_O_SR) & SSI_RX_NOT_EMPTY) {
        /* Read element from RX FIFO and discard */
        HWREG(hwAttrs->baseAddr + SSI_O_DR);
    }

    /* Enable TESTFIFO mode */
    HWREG(hwAttrs->baseAddr + SSI_O_TCR) = SSI_TCR_TESTFIFO_ENABLE;

    /* Flush TX FIFO */
    while(!(HWREG(hwAttrs->baseAddr + SSI_O_SR) & SSI_TX_EMPTY)) {
        /* Read element from TX FIFO and discard */
        HWREG(hwAttrs->baseAddr + SSI_O_TDR);
    }

    /* Disable TESTFIFO mode */
    HWREG(hwAttrs->baseAddr + SSI_O_TCR) = SSI_TCR_TESTFIFO_DISABLE;
}

/*!
 *  @brief SPI CC26XX initialization
 *
 *  The function will set the isOpen flag to false.
 *
 *  @pre    Calling context: Hwi, Swi, Task, Main
 *
 *  @param handle  A SPI_Handle
 *
 */
void SPICC26XXDMA_init(SPI_Handle handle)
{
    SPICC26XXDMA_Object         *object;

    /* Get the pointer to the object */
    object = handle->object;

    /* Mark the object as available */
    object->isOpen = false;

    /* Init power constraint flag. */
    object->spiPowerConstraint = false;
}

/*!
 *  @brief  Function to initialize the CC26XX SPI peripheral specified by the
 *          particular handle. The parameter specifies which mode the SPI
 *          will operate.
 *
 *  The function will set a dependency on it power domain, i.e. power up the
 *  module and enable the clock. The IOs are allocated. Neither the SPI nor UDMA module
 *  will be enabled.
 *
 *  @pre    SPI controller has been initialized.
 *          Calling context: Task
 *
 *  @param  handle        A SPI_Handle
 *
 *  @param  params        Pointer to a parameter block, if NULL it will use
 *                        default values
 *
 *  @return A SPI_Handle on success or a NULL on an error or if it has been
 *          already opened
 *
 *  @sa     SPICC26XXDMA_close()
 */
SPI_Handle SPICC26XXDMA_open(SPI_Handle handle, SPI_Params *params)
{
    /* Use union to save on stack allocation */
    union {
        Semaphore_Params        semParams;
        Hwi_Params              hwiParams;
        Swi_Params              swiParams;
    } paramsUnion;
    SPICC26XXDMA_Object        *object;
    SPICC26XXDMA_HWAttrs const *hwAttrs;
    unsigned int                key;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Disable preemption while checking if the SPI is open. */
    key = Hwi_disable();

    /* Check if the SPI is open already with the base addr. */
    if (object->isOpen == true) {
        Hwi_restore(key);

        Log_warning1("SPI:(%p) already in use.", hwAttrs->baseAddr);

        return (NULL);
    }

    /* Mark the handle as being used */
    object->isOpen = true;
    Hwi_restore(key);

    Assert_isTrue((params->dataSize >= 4) &&
                  (params->dataSize <= 16), NULL);

    /* Initialize the SPI object */
    object->currentTransaction = NULL;
    object->bitRate            = params->bitRate;
    object->dataSize           = params->dataSize;
    object->frameFormat        = params->frameFormat;
    object->mode               = params->mode;
    object->transferMode       = params->transferMode;
    object->transferTimeout    = params->transferTimeout;
    object->returnPartial      = false;
#ifdef SPICC26XXDMA_WAKEUP_ENABLED
    object->wakeupCallbackFxn  = NULL;
#endif

